In [2]:
import pandas as pd

In [ ]:
# Pandas built ontop of what other Python library?
# numpy

In [4]:
file = "Resources/sampleData.csv"

In [5]:
df_original = pd.read_csv(file)
df_original.head()

   id first_name   last_name       Phone Number      Time zone
0   1      Peter  Richardson    7-(789)867-9023  Europe/Moscow
1   2     Janice       Berry   86-(614)973-1727    Asia/Harbin
2   3     Andrea      Hudson   86-(918)527-6371  Asia/Shanghai
3   4     Arthur    Mcdonald  420-(553)779-7783  Europe/Prague
4   5      Kathy     Morales  351-(720)541-2124  Europe/Lisbon

In [17]:
# Set new index to last_name
df = df_original.set_index("last_name")
df.head()

            id first_name       Phone Number      Time zone
last_name
Richardson   1      Peter    7-(789)867-9023            NaN
Berry        2     Janice   86-(614)973-1727    Asia/Harbin
Hudson       3     Andrea   86-(918)527-6371  Asia/Shanghai
Mcdonald     4     Arthur  420-(553)779-7783  Europe/Prague
Morales      5      Kathy  351-(720)541-2124  Europe/Lisbon

In [26]:
import numpy as np
df_original.iloc[0,4] = np.nan

df_original.head

<bound method NDFrame.head of      id first_name   last_name       Phone Number      Time zone
0     1      Peter  Richardson    7-(789)867-9023            NaN
1     2     Janice       Berry   86-(614)973-1727    Asia/Harbin
2     3     Andrea      Hudson   86-(918)527-6371  Asia/Shanghai
3     4     Arthur    Mcdonald  420-(553)779-7783  Europe/Prague
4     5      Kathy     Morales  351-(720)541-2124  Europe/Lisbon
..  ...        ...         ...                ...            ...
95   96     Arthur   Henderson   81-(353)751-4060     Asia/Tokyo
96   97  Christina       Riley   93-(374)749-5085     Asia/Kabul
97   98   Nicholas       Green   86-(750)462-3375  Asia/Shanghai
98   99      Debra      Peters   86-(879)987-9025  Asia/Shanghai
99  100    Matthew      Murray  353-(195)215-1300  Europe/Dublin

[100 rows x 5 columns]>

In [29]:
# conditional operators
# and - $
# or - |
# ==, !=, >, <, >=, <=, isin
df_original["id"].isin([1,2])

0      True
1      True
2     False
3     False
4     False
      ...
95    False
96    False
97    False
98    False
99    False
Name: id, Length: 100, dtype: bool

In [33]:
# filter
cond = df_original["id"] > 5
cols = ["id", "last_name"]
#df_original.loc[cond, cols]
df_original[cond][cols]

     id  last_name
5     6      Reyes
6     7        Kim
7     8     Hudson
8     9        Day
9    10       Ford
..  ...        ...
95   96  Henderson
96   97      Riley
97   98      Green
98   99     Peters
99  100     Murray

[95 rows x 2 columns]

In [45]:
# lambda is make a function and not name it
def make_a_list(x):
    return list(x)

In [46]:
# groupby
#df_original.groupby(["first_name"])
#g = df_original.groupby(["first_name"])
#df = pd.DataFrame({
#    "id average" : g["id"].mean(),
#    "last name": g["last_name"].count
#})

# Chaining is better
df_original.groupby(["first_name"]).agg('count')
df_original.groupby(["first_name"]).agg({
    "id": 'mean',
    "last_name" : 'count',
   # "Phone Number": lambda x: tuple(x)
    "Phone Number": make_a_list
})

,id,last_name,Phone Number
first_name,,,
Albert,35.500000,2,"[66-(280)413-6219, 62-(248)357-7731]"
Amy,35.000000,1,[62-(615)564-2160]
Andrea,3.000000,1,[86-(918)527-6371]
Arthur,60.666667,3,"[420-(553)779-7783, 86-(599)522-0287, 81-(353)..."
Ashley,79.000000,1,[86-(384)362-8423]
...,...,...,...
Tammy,68.500000,2,"[86-(157)921-6682, 81-(326)780-6025]"
Teresa,41.000000,1,[33-(828)225-6343]
Theresa,89.000000,1,[84-(622)290-6430]
Victor,31.000000,2,"[56-(946)201-0528, 86-(811)655-6681]"
Willie,72.000000,1,[81-(765)778-5179]

In [23]:
# Select Series
# Select id
# Count - counts non-NaN values
# Helps to find missing value
df_original.count()

id              100
first_name      100
last_name       100
Phone Number    100
Time zone        99
dtype: int64

In [9]:
len(df_original)

100

<bound method NDFrame.head of      id first_name   last_name       Phone Number      Time zone
0     1      Peter  Richardson    7-(789)867-9023            NaN
1     2     Janice       Berry   86-(614)973-1727    Asia/Harbin
2     3     Andrea      Hudson   86-(918)527-6371  Asia/Shanghai
3     4     Arthur    Mcdonald  420-(553)779-7783  Europe/Prague
4     5      Kathy     Morales  351-(720)541-2124  Europe/Lisbon
..  ...        ...         ...                ...            ...
95   96     Arthur   Henderson   81-(353)751-4060     Asia/Tokyo
96   97  Christina       Riley   93-(374)749-5085     Asia/Kabul
97   98   Nicholas       Green   86-(750)462-3375  Asia/Shanghai
98   99      Debra      Peters   86-(879)987-9025  Asia/Shanghai
99  100    Matthew      Murray  353-(195)215-1300  Europe/Dublin

[100 rows x 5 columns]>

In [12]:
# Grab the data contained within the "Berry" row and the "Phone Number" column
berry_phone = df.loc["Berry", "Phone Number"]
print("Using Loc: " + berry_phone)

also_berry_phone = df.iloc[1, 2]
print("Using Iloc: " + also_berry_phone)

Using Loc: 86-(614)973-1727
Using Iloc: 86-(614)973-1727

In [13]:
# Grab the first five rows of data and the columns from "id" to "Phone Number"
# The problem with using "last_name" as the index is that the values are not unique so duplicates are returned
# If there are duplicates and loc[] is being used, Pandas will return an error
richardson_to_morales = df.loc[["Richardson", "Berry", "Hudson",
                                "Mcdonald", "Morales"], ["id", "first_name", "Phone Number"]]
print(richardson_to_morales)

print()

# Using iloc[] will not find duplicates since a numeric index is always unique
also_richardson_to_morales = df.iloc[0:4, 0:3]
print(also_richardson_to_morales)

            id first_name       Phone Number
last_name
Richardson   1      Peter    7-(789)867-9023
Richardson  25     Donald   62-(259)282-5871
Berry        2     Janice   86-(614)973-1727
Hudson       3     Andrea   86-(918)527-6371
Hudson       8    Frances   57-(752)864-4744
Hudson      90      Norma  351-(551)598-1822
Mcdonald     4     Arthur  420-(553)779-7783
Morales      5      Kathy  351-(720)541-2124

            id first_name       Phone Number
last_name
Richardson   1      Peter    7-(789)867-9023
Berry        2     Janice   86-(614)973-1727
Hudson       3     Andrea   86-(918)527-6371
Mcdonald     4     Arthur  420-(553)779-7783

In [7]:
# The following will select all rows for columns `first_name` and `Phone Number`
df.loc[:, ["first_name", "Phone Number"]].head()

           first_name       Phone Number
last_name
Richardson      Peter    7-(789)867-9023
Berry          Janice   86-(614)973-1727
Hudson         Andrea   86-(918)527-6371
Mcdonald       Arthur  420-(553)779-7783
Morales         Kathy  351-(720)541-2124

In [8]:
# the following logic test/conditional statement returns a series of boolean values
named_billy = df["first_name"] == "Billy"
named_billy.head()

last_name
Richardson    False
Berry         False
Hudson        False
Mcdonald      False
Morales       False
Name: first_name, dtype: bool

In [9]:
# Loc and Iloc also allow for conditional statments to filter rows of data
# using Loc on the logic test above only returns rows where the result is True
only_billys = df.loc[df["first_name"] == "Billy", :]
print(only_billys)

print()

# Multiple conditions can be set to narrow down or widen the filter
only_billy_and_peter = df.loc[(df["first_name"] == "Billy") | (
    df["first_name"] == "Peter"), :]
print(only_billy_and_peter)

           id first_name      Phone Number       Time zone
last_name
Clark      20      Billy  62-(213)345-2549   Asia/Makassar
Andrews    23      Billy  86-(859)746-5367  Asia/Chongqing
Price      59      Billy  86-(878)547-7739   Asia/Shanghai

            id first_name      Phone Number       Time zone
last_name
Richardson   1      Peter   7-(789)867-9023   Europe/Moscow
Clark       20      Billy  62-(213)345-2549   Asia/Makassar
Andrews     23      Billy  86-(859)746-5367  Asia/Chongqing
Price       59      Billy  86-(878)547-7739   Asia/Shanghai